package ru.gb.java_core2_2.l1;

public class Classwork {

    public static void main(String[] args) {

        //модификаторы доступа потестить
        /*
        public - доступ во всем проекте
        protected - доступ внутри пакета и в производных класса, которые могут находиться вне пакета.
                    Применим только для вложенных классов.
        default - доступ только внутри пакета (модификатор доступ отсутствует)
        private - доступ только внутри класса. Применим только для вложенных классов.
         */




        //время 23:55


    }
}
