package ru.gb.java_core2_2.l1;

public class Classwork {

    public static void main(String[] args) {

        //модификаторы доступа потестить
        /*
        public - доступ во всем проекте
        protected - доступ внутри пакета и в производных класса, которые могут находиться вне пакета.
                    Применим только для вложенных классов.
        default - доступ только внутри пакета (модификатор доступ отсутствует)
        private - доступ только внутри класса. Применим только для вложенных классов.

         Абстрактный класс:
         - не можем создавать экземпляры класса
         - можем писать абстрактные методы без реализации
         две формулировки одного и того же:
           1)все наследники абстрактного класса обязаны описать реализацию всех абстрактных методов абстрактного класса,
             либо в классе наследнике метод станет тоже абстрактным.
           2)абстрактный класс обязует каждого своего наследника описать реализацию всех своих абстрактных методов




         */




        //время 23:55


    }
}
